+ Return to velocity statistics from the Orion KPNO and SPM datasets
+ Coming back to it after 7 years!
+ In support of Jane & Sac's work on the 512-cube hydro simulations

16 Jan 2014


* Data for Sac

** Velocity moment maps from Tere 2008 paper
:PROPERTIES:
:EXPORT_FILE_NAME: Moment-Maps/README
:END:
+ Data is in =OrionStats/Moment-Maps=
+ Filename pattern is =LINE_-040+070.wisomom-VAR-SMOOTH.fits=
  + =LINE= emission line:
    + =DOHha= H\alpha
    + =DOHnii= [N II] 6583
    + =DOHoiii= [O III] 5007
    + =oi= [O I] 6300
    + =siii= [S III] 6312
    + =siil= [S II] 6731
    + =siis= [S II] 6716
  + =-040+070= velocity range of window for calculating moments: \minus{}40 \to +70 km/s heliocentric.
  + =VAR= the quantity represented in the FITS file:
    + =sum=: 0-th moment, total intensity
    + =mean=: mean velocity (km/s)
    + =sigma=: RMS line width (km/s)
    + =peak=: velocity of peak emission (IGNORE)
    + =fwhm=: full-width-half-maximum line width (IGNORE)
  + =SMOOTH=: the interpolation method used (IGNORE)
+ The lines beginning =DOH= come from the dataset of Doi, O'Dell & Hartigan (2004AJ....127.3456D) and have a pixel scale of 0.534 arcsec
+ The other data (from SPM) have a pixel scale of 0.62 arcsec



* Structure functions
+ Initial work is in [[file:~/Work/BobKPNO/]]
+ Sac is now going to work on this [2014-01-16 Thu]
+ 


** Spot test on the structure function
:PROPERTIES:
:EXPORT_FILE_NAME: spot-test
:END:


+ Take random pairs of spots on the =siil_-040+070= mean map with roughly similar separations
+ Use the =c= key in ds9 to record the coordinates and velocity of each point
+ The paste it into a spreadsheet to calculate the mean separation and mean square velocity difference


*** Results
+ At larger separations (\approx 250\prime\prime) we get B \approx 15 \pm 9 km^{2}/s^{2}
  + But note that over half of that comes from one pair of points.  If it is excluded, B drops to 6.
+ At smaller separations (\approx 50\prime\prime) we get B \approx 9 \pm 3 km^{2}/s^{2}
+ These are all much bigger than Sac's values

***  Large separations

|        x_{1} |        y_{1} |      u_{1} |        x_{2} |        y_{2} |      u_{2} | (dx^{2} + dy^{2})^{1/2} |        (du)^{2} |
|-----------+-----------+---------+-----------+-----------+---------+----------------+--------------|
| 228.73259 |  278.9557 | 21.2499 | 71.077532 | 415.11234 | 19.0336 |          208.3 |          4.9 |
| 167.30854 | 495.98734 | 19.2231 | 251.25475 | 296.35918 | 20.6113 |          216.6 |          1.9 |
| 42.412975 | 385.42405 | 22.5926 | 75.172468 | 227.76899 | 24.0808 |          161.0 |          2.2 |
| 80.291139 | 129.49051 | 16.8184 | 126.35918 | 338.33228 | 25.6361 |          213.9 |         77.8 |
| 228.73259 | 506.22468 | 22.1082 | 68.006329 | 334.23734 | 22.0526 |          235.4 |         3e-3 |
| 248.18354 | 459.13291 | 20.0254 | 93.599684 | 214.46044 | 22.7409 |          289.4 |          7.4 |
| 77.219937 | 505.20095 | 20.7926 | 146.83386 | 171.46361 | 23.7882 |          340.9 |          9.0 |
| 59.816456 |  123.3481 | 17.4019 |  112.0269 | 402.82753 | 21.9822 |          284.3 |         21.0 |
|-----------+-----------+---------+-----------+-----------+---------+----------------+--------------|
|           |           |         |           |           |         | 243.7 +/- 20.3 | 15.5 +/- 9.2 |
#+TBLFM: $7=sqrt(($1 - $4)**2 + ($2 - $5)**2);f1::$8=($3 - $6)**2;f1::@10$7..@10$8=vmeane(@I..@II);f1

*** Smaller separations

|        x_{1} |        y_{1} |      u_{1} |        x_{2} |        y_{2} |      u_{2} | (dx^{2} + dy^{2})^{1/2} |       (du)^{2} |
|-----------+-----------+---------+-----------+-----------+---------+----------------+-------------|
| 130.45411 | 507.24842 | 22.6563 |  157.0712 | 506.22468 | 20.5858 |           26.6 |         4.3 |
| 82.338608 | 468.34652 | 19.6905 |  85.40981 | 512.36709 | 20.9023 |           44.1 |         1.5 |
|  48.55538 | 420.23101 | 19.3072 | 28.080696 | 381.32911 | 22.3716 |           44.0 |         9.4 |
| 167.30854 | 384.40032 | 23.6558 | 126.35918 | 411.01741 | 23.4309 |           48.8 |        5e-2 |
| 278.89557 | 463.22785 | 20.6298 | 275.82437 | 418.18354 | 18.7398 |           45.1 |         3.6 |
| 271.72943 | 346.52215 | 24.6568 | 221.56646 | 370.06804 | 20.5589 |           55.4 |        16.8 |
| 183.68829 | 273.83703 | 20.0625 | 233.85127 |  320.9288 | 24.9549 |           68.8 |        23.9 |
| 104.86076 | 308.64399 | 23.1508 |  112.0269 | 257.45728 | 20.3042 |           51.7 |         8.1 |
| 104.86076 | 125.39557 | 18.0629 | 92.575949 | 177.60601 | 18.6064 |           53.6 |         0.3 |
| 21.938291 |  120.2769 | 18.9919 | 91.552215 | 130.51424 | 17.5816 |           70.4 |         2.0 |
| 213.37658 | 210.36551 | 26.6213 |  276.8481 | 256.43354 | 19.7478 |           78.4 |        47.2 |
| 262.51582 | 186.81962 | 28.8139 | 219.51899 | 150.98892 | 27.2194 |           56.0 |         2.5 |
| 170.37975 | 111.06329 | 19.9815 | 148.88133 |  165.3212 | 22.7654 |           58.4 |         7.8 |
| 103.83703 | 99.802215 | 18.6342 | 83.362342 | 152.01266 | 17.2948 |           56.1 |         1.8 |
| 70.053797 | 412.04114 | 19.2007 | 80.291139 | 361.87816 | 22.4601 |           51.2 |        10.6 |
|-----------+-----------+---------+-----------+-----------+---------+----------------+-------------|
|           |           |         |           |           |         |   53.9 +/- 3.2 | 9.3 +/- 3.2 |
#+TBLFM: $7=sqrt(($1 - $4)**2 + ($2 - $5)**2);f1::$8=($3 - $6)**2;f1::@17$7..@17$8=vmeane(@I..@II);f1

* Velocity channel analysis
+ [ ] Maybe add together the [N II] and [O III] cubes
+ [ ] Thin versus thin slices from the Orion data
  + Not so clear that there is shallower power spectrum in the thin slices than in the thin slices
  + But there is definitely a higher amplitude of fluctuations
  + Anyway, we need to measure it

* Export options 

#+TITLE: orion-stats
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not "LOGBOOK") date:t
#+OPTIONS: e:t email:nil f:t inline:t num:nil p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t toc:nil todo:t |:t
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
